app/Controllers/Anggota.php

    public function list_view_anggota()
    {
        $id = $this->request->getVar('id');
        $v = $this->builder2
                    ->join('tbl_anggota', 'users.anggota_id = tbl_anggota.id')
                    ->select('
                        tbl_anggota.nama_lengkap as nama_lengkap,
                        tbl_anggota.jabatan as jabatan,
                        tbl_anggota.no_telp as no_telp,
                        tbl_anggota.alamat as alamat,
                        users.active as active,
                        users.username as username,
                        users.email as email,
                        tbl_anggota.log as log,
                        tbl_anggota.foto as foto,
                        tbl_anggota.tanggal_masuk as tanggal_masuk,
                        users.id as user_id
                    ')
                    ->where('users.id', $id)
                    ->get()->getResult();
---
SELECT `tbl_anggota`.`nama_lengkap` as `nama_lengkap`, `tbl_anggota`.`jabatan` as `jabatan`, `tbl_anggota`.`no_telp` as `no_telp`, `tbl_anggota`.`alamat` as `alamat`, `users`.`active` as `active`, `users`.`username` as `username`, `users`.`email` as `email`, `tbl_anggota`.`log` as `log`, `tbl_anggota`.`foto` as `foto`, `tbl_anggota`.`tanggal_masuk` as `tanggal_masuk`, `users`.`id` as `user_id`
FROM `users`
JOIN `tbl_anggota` ON `users`.`anggota_id` = `tbl_anggota`.`id`
WHERE `users`.`id` = '2'