app/Controllers/Iuran.php



        $Anggota = new AnggotaModel();
        $builder = $Anggota->where('id', user_id())->first();
---
SELECT *
FROM `tbl_anggota`
WHERE `id` = '2'
 LIMIT 1

            // 'iuran'             => $nBulan,


            'anggota'           => $Anggota->findAll(),
---
SELECT *
FROM `tbl_anggota`

    public function create()
    {

        // $nvar = (isset($var))? $var : date("Y-m-d");

        $Anggota = new AnggotaModel();
        $builder = $Anggota->where('id', user_id())->first();

        $build = $builder;


        session();
        $data = [
            // 'var'               => $nvar,
            'anggota'           => $Anggota->findAll(),
---
SELECT *
FROM `tbl_anggota`
WHERE `id` = '2'
 LIMIT 1
SELECT *
FROM `tbl_anggota`

            ];


            $Iuran->insert($data1);
---
INSERT INTO `tbl_iuran` (`nominal_iuran`, `sts_iuran`, `created_at_iuran`, `updated_at_iuran`) VALUES ('10000', '2', '2023-01-24 16:26:00', NULL)

    public function edit($var)
    {

        $nvar = (isset($var))? $var : '';

        $Anggota =  new AnggotaModel();
        $Iuran =  new IuranModel();


        $builder = $Anggota->where('id', user_id())->first();

        $build = $builder;


        session();
        $data = [
            'data'              => $Iuran->where('id', $nvar)->first(),
            'anggota'           => $Anggota->findAll(),
            'validation' 		=> \Config\Services::validation(),
        ];
---
SELECT *
FROM `tbl_anggota`
WHERE `id` = '2'
 LIMIT 1
SELECT *
FROM `tbl_iuran`
WHERE `id` = '9'
 LIMIT 1
SELECT *
FROM `tbl_anggota`

    public function delete($var)
    {

        $Iuran =  new IuranModel();
        $Iuran->delete($var);
---
DELETE FROM `tbl_iuran`
WHERE `id` IN ('9')