app/Controllers/Presensi.php

SELECT `tbl_kegiatan`.`id` as `kode_id`, `tbl_anggota`.`nama_lengkap` as `nama_lengkap`, `tbl_kegiatan`.`nama_kgt` as `nama_kgt`, `tbl_presensi`.`created_at_prsn` as `waktu_presensi`, `tbl_kegiatan`.`keterangan_kgt` as `keterangan_kgt`, `tbl_presensi`.`id` as `presensi_id`
FROM `tbl_presensi`
JOIN `tbl_anggota` ON `tbl_presensi`.`anggota_id` = `tbl_anggota`.`id`
JOIN `tbl_kegiatan` ON `tbl_presensi`.`kegiatan_id` = `tbl_kegiatan`.`id`
---
    public function pdf($var = null)
    {


        $Presensi = new PresensiModel();

        $get_presensi = $Presensi
                            ->join('tbl_anggota', 'tbl_presensi.anggota_id = tbl_anggota.id')
                            ->join('tbl_kegiatan', 'tbl_presensi.kegiatan_id = tbl_kegiatan.id')
                            ->select('
                                tbl_kegiatan.id as kode_id,
                                tbl_anggota.nama_lengkap as nama_lengkap,
                                tbl_kegiatan.nama_kgt as nama_kgt,
                                tbl_presensi.created_at_prsn as waktu_presensi,
                                tbl_kegiatan.keterangan_kgt as keterangan_kgt,
                                tbl_presensi.id as presensi_id
                            ')
                            ->findAll();

SELECT *
FROM `tbl_anggota`
WHERE `id` = '1'
 LIMIT 1
---
    public function index()
    {
        $Anggota = new AnggotaModel();
        $builder = $Anggota->where('id', user_id())->first();

SELECT *
FROM `tbl_anggota`
WHERE `id` = '1'
 LIMIT 1
SELECT *
FROM `tbl_anggota`
SELECT *
FROM `tbl_kegiatan`
---
    public function create()
    {


        $Kegiatan = new KegiatanModel();
        $Anggota = new AnggotaModel();
	    $build = $Anggota->where('id', user_id())->first();

        session();
        $data = [
            'anggota'           => $Anggota->findAll(),
            'kegiatan'          => $Kegiatan->findAll(),
            'validation' 		=> \Config\Services::validation(),
        ];